app/controllers/api/v1/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@example.com"], ["LIMIT", 1]]
---
        def create
          user = User.find_by(email: params[:user][:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        def find_user_from_token
          return unless request.headers['Authorization'].present?

          token = request.headers['Authorization'].split(' ').last

          # Add this line for debugging to check the secret value
          Rails.logger.debug("JWT Secret: #{Rails.application.credentials.devise[:jwt_secret_key]}")

          jwt_payload = JWT.decode(token, Rails.application.credentials.devise[:jwt_secret_key]).first
          User.find(jwt_payload['sub'])